In [2]:
import numpy as np
import pandas as pd

# Pandas分组

## groupby

groupby 对DataFrame进行数据分组，传入列名列表或者Series序列对象，
返回生成一个GroupBy对象，它实际上还没有进行任何计算。

Groupby对象是一个迭代对象，每次迭代结果是一个元组。
元组的第一个元素是该组的名称（就是Groupby的列的元素名称）
第二个元素是该组的具体信息，是一个数据框，
索引是以前的数据框的总索引

### Pandas分组与聚合操作

In [3]:
data=pd.DataFrame({'data1':np.random.randint(1,9,5),
                  'data2':np.random.randint(1,9,5),
                  'key1':list('aabba'),
                  'key2':['one','one','two','one','two']
                  })
data

   data1  data2 key1 key2
0      3      6    a  one
1      6      6    a  one
2      1      5    b  two
3      5      6    b  one
4      3      1    a  two

In [4]:
datas=data.groupby('key1')
data.loc[:,['data1','data2']]

   data1  data2
0      3      6
1      6      6
2      1      5
3      5      6
4      3      1

In [5]:
data.loc[:,['data1','data2']].mean(axis=1)

0    4.5
1    6.0
2    3.0
3    5.5
4    2.0
dtype: float64

In [6]:
for i in datas:
    print(i)

('a',    data1  data2 key1 key2
0      3      6    a  one
1      6      6    a  one
4      3      1    a  two)
('b',    data1  data2 key1 key2
2      1      5    b  two
3      5      6    b  one)

In [7]:
#通过key1进行分组，分别进行聚合操作
datas.mean()

      data1     data2
key1
a       4.0  4.333333
b       3.0  5.500000

In [8]:
datas.sum()

      data1  data2
key1
a        12     13
b         6     11

In [9]:
datas.min()

      data1  data2 key2
key1
a         3      1  one
b         1      5  one

In [10]:
datas.max()

      data1  data2 key2
key1
a         6      6  two
b         5      6  two

In [11]:
datas=data.groupby('key2')
datas

In [12]:
for i in datas:
    print(i)

('one',    data1  data2 key1 key2
0      3      6    a  one
1      6      6    a  one
3      5      6    b  one)
('two',    data1  data2 key1 key2
2      1      5    b  two
4      3      1    a  two)

In [13]:
#随机下标
key=[1,2,2,1,2]
data.groupby(key)['data1'].mean()

1    4.000000
2    3.333333
Name: data1, dtype: float64

In [14]:
#通过某一列进行分组，分别获取一列或者两列数据
data.groupby('key1')['data1'].sum()

key1
a    12
b     6
Name: data1, dtype: int32

In [15]:
data.groupby('key1')['data1','data2'].sum()

      data1  data2
key1
a        12     13
b         6     11

In [16]:
datas=data.groupby(['key1','key2'])['data1','data2'].sum().unstack()

In [17]:
datas

     data1     data2
key2   one two   one two
key1
a        9   3    12   1
b        5   1     6   5

In [18]:
datas['data1']

key2  one  two
key1
a       9    3
b       5    1

In [19]:
datas.loc[:,'data1']['one']

key1
a    9
b    5
Name: one, dtype: int32

In [20]:
data['data1'].groupby([data['key1']]).sum()

key1
a    12
b     6
Name: data1, dtype: int32

# Pandas聚合之apply

apply是pandas库的一个很重要的函数多喝groupby函数一起使用，
也可以直接用于DataFrame和Series对象，主要用于数据聚合运算，
可以方便的对分组进行现有的运算和自定义的运算。

![apply](apply.png)

In [21]:
df1=pd.DataFrame(np.random.randint(1,9,(4,4)),columns=list('abcd'))
df1

   a  b  c  d
0  8  4  4  2
1  2  6  7  1
2  3  5  7  7
3  2  6  1  3

In [22]:
df1.apply(lambda x:x*10)

    a   b   c   d
0  80  40  40  20
1  20  60  70  10
2  30  50  70  70
3  20  60  10  30

In [23]:
df1['a'].apply(lambda x : x*10)

0    80
1    20
2    30
3    20
Name: a, dtype: int64

In [24]:
df1.apply(lambda x:x*10,axis=1)

    a   b   c   d
0  80  40  40  20
1  20  60  70  10
2  30  50  70  70
3  20  60  10  30

In [25]:
df1.loc[0:2].apply(lambda x:x*10)

    a   b   c   d
0  80  40  40  20
1  20  60  70  10
2  30  50  70  70

In [26]:
def f1(x):
    return x+10
df1.apply(f1)

    a   b   c   d
0  18  14  14  12
1  12  16  17  11
2  13  15  17  17
3  12  16  11  13

In [27]:
df1[['b','c']].apply(f1)

    b   c
0  14  14
1  16  17
2  15  17
3  16  11

In [28]:
df1.apply(f1,axis=1)

    a   b   c   d
0  18  14  14  12
1  12  16  17  11
2  13  15  17  17
3  12  16  11  13

In [29]:
df1.apply(f1,axis=1)

    a   b   c   d
0  18  14  14  12
1  12  16  17  11
2  13  15  17  17
3  12  16  11  13

In [30]:
df1.loc[2:3].apply(f1)

    a   b   c   d
2  13  15  17  17
3  12  16  11  13

In [31]:
df1 = pd.DataFrame(np.random.randint(1,9,(4,4)),columns=list('abcd'))
df1

   a  b  c  d
0  4  1  8  1
1  7  2  3  7
2  6  3  3  4
3  3  5  8  2

求平均：

In [32]:
def means(x):
    return x.mean()#return pd.Series(x.means())
re = df1.apply(means)
type(re)

pandas.core.series.Series

In [33]:
re

a    5.00
b    2.75
c    5.50
d    3.50
dtype: float64

求和：

In [34]:
def sums(x):
    return x.sum()
re = df1.apply(sums)
re

a    20
b    11
c    22
d    14
dtype: int64

#### 自定义操作-字符串拼接

In [35]:
data=np.random.randint(1,10,(4,4))
data
df1=pd.DataFrame(data,columns=['a','b','c','d'])

def f4(x,str_text):
    return (str(x)+str_text)

In [36]:
df1

   a  b  c  d
0  4  1  1  1
1  6  2  3  4
2  1  4  3  7
3  8  7  5  9

In [37]:
df1['a'].apply(f4,args=('haha',)) #通过args传入参数元组

0    4haha
1    6haha
2    1haha
3    8haha
Name: a, dtype: object

In [38]:
#提取表格中的时间
import time
df2=pd.DataFrame(np.random.randint(1,9,(4,4)),columns=list('ABCD'))
df2['E']=pd.date_range('20180101',periods=4)
def ft(x):
    time_tup=time.strptime(str(x),'%Y-%m-%d %H:%M:%S')
    return pd.Series([time_tup[0],time_tup[1],time_tup[2]])
df2['E'].apply(ft)

      0  1  2
0  2018  1  1
1  2018  1  2
2  2018  1  3
3  2018  1  4

In [39]:
df2

   A  B  C  D          E
0  1  6  6  8 2018-01-01
1  1  7  2  4 2018-01-02
2  7  8  6  7 2018-01-03
3  7  6  3  8 2018-01-04

In [40]:
df6 = pd.DataFrame({
    'name':['joe', 'susan', 'anne', 'black', 'monika','ronaldo','leonarldo','tom','yilianna','bulanni'],
    'age':[19,19,18,20,20,18,19,20,18,19],
    'sex':['man','women','women','man','women','man','man','man','women','women'],
    'address':['上海','北京','上海','北京','北京','上海','北京','上海','北京','上海'],
    'money':[8000,8500,7000,9000,10000,7500,8800,9300,12000,11000]
})
#1 根据地区进行分组，查看平均年龄和工资
#2 根据年龄进行分组，查看平均工资
#3 根据性别进行分组，查看平均工资
#3 先根据地区然后根据性别进行分组，查看各地不同地区不同性别的平均工资

In [41]:
df6

  address  age  money       name    sex
0      上海   19   8000        joe    man
1      北京   19   8500      susan  women
2      上海   18   7000       anne  women
3      北京   20   9000      black    man
4      北京   20  10000     monika  women
5      上海   18   7500    ronaldo    man
6      北京   19   8800  leonarldo    man
7      上海   20   9300        tom    man
8      北京   18  12000   yilianna  women
9      上海   19  11000    bulanni  women

In [42]:
#1 根据地区进行分组，查看平均年龄和工资
def means(x):
    return x.mean()#return pd.Series(x.means())
datas = df6.groupby('address')['money','age'].apply(means)
datas

          money   age
address
上海       8560.0  18.8
北京       9660.0  19.2

In [43]:
#2 根据年龄进行分组，查看平均工资
datas = df6.groupby('age')['money'].apply(means)
datas

age
18    8833.333333
19    9075.000000
20    9433.333333
Name: money, dtype: float64

In [91]:
#3 根据性别进行分组，查看平均工资
datas = df6.groupby('sex')['money'].apply(means)
datas

sex
man      8520.0
women    9700.0
Name: money, dtype: float64

In [94]:
#4 先根据地区然后根据性别进行分组，查看各地不同地区不同性别的平均工资
datas = df6.groupby(['address','sex'])['money'].apply(means)
datas

address  sex
上海       man       8266.666667
         women     9000.000000
北京       man       8900.000000
         women    10166.666667
Name: money, dtype: float64

## agg()进行分组 
可以在（）中加多个聚合函数

In [96]:
datas = df6.groupby(['address','sex'])['money'].agg(means,)
datas

address  sex
上海       man       8266.666667
         women     9000.000000
北京       man       8900.000000
         women    10166.666667
Name: money, dtype: float64

In [103]:
#根据地区进行分组，查看工资的平均，最大最小最大最小差
def diff(x):
    return  x.max() - x.min()
datas = df6.groupby(['address'])['money'].agg(['mean','min','max',('cha',diff)])
datas

         mean   min    max   cha
address
上海       8560  7000  11000  4000
北京       9660  8500  12000  3500

In [104]:
df = pd.DataFrame({'性别' : ['男', '女', '男', '女',
                              '男', '女', '男', '男'],
                   '成绩' : ['优秀', '优秀', '及格', '差',
                              '及格', '及格', '优秀', '差'],
                   '年龄' : [13,14,15,12,13,14,15,16]})
df
#1.根据性别进行成绩排序
#2.计算男女比例
#3. 计算成绩分布，每个成绩段有多少人

   年龄 性别  成绩
0  13  男  优秀
1  14  女  优秀
2  15  男  及格
3  12  女   差
4  13  男  及格
5  14  女  及格
6  15  男  优秀
7  16  男   差

In [129]:
#1.根据性别进行成绩排序
def st(x):
    return x.sort_values(by='成绩')
df.groupby('性别').apply(st)

      年龄 性别  成绩
性别
女  1  14  女  优秀
   5  14  女  及格
   3  12  女   差
男  0  13  男  优秀
   6  15  男  优秀
   2  15  男  及格
   4  13  男  及格
   7  16  男   差

In [136]:
#2.计算男女比例
total=df['性别'].count()
total
value_sex = df.groupby('性别')['性别'].count()
value_sex.apply(lambda x:str(x/total*100)+'%')

性别
女    37.5%
男    62.5%
Name: 性别, dtype: object

In [137]:
#3. 计算成绩分布，每个成绩段有多少人
score = df.groupby('成绩')['成绩'].count()
score.apply(lambda x:str(x) +'人')

成绩
优秀    3人
及格    3人
差     2人
Name: 成绩, dtype: object

## Pandas聚合之数据透视

数据透视表pivot_table，跟距一个获多个键进行聚合，并根据行列上的分组
将数据分配到各个矩形区域中。

pivot_table相较与groupby更简单

DataFrame.pivot_table(data,values=None,index=None,columns=None,
                      aggfunc='mean',fill-value=None,margins=False,
                      dropna=True,margins_name='All')

In [138]:
data=pd.DataFrame({'data1':np.random.randint(1,9,5),
                  'data2':np.random.randint(1,9,5),
                  'key1':list('aabba'),
                  'key2':['one','one','two','one','two']
                  })
data

   data1  data2 key1 key2
0      3      6    a  one
1      4      4    a  one
2      6      5    b  two
3      2      8    b  one
4      3      2    a  two

In [139]:
data.pivot_table(values=['data1','data2'],index=['key1'],columns=['key2'],aggfunc=np.mean)

     data1      data2
key2   one  two   one  two
key1
a      3.5  3.0   5.0  2.0
b      2.0  6.0   8.0  5.0

In [142]:
data.pivot_table(values=['data1'],index=['key1'],aggfunc=np.mean)
#

         data1
key1
a     3.333333
b     4.000000

In [143]:
data.groupby('key1')['data1'].mean()

key1
a    3.333333
b    4.000000
Name: data1, dtype: float64

In [144]:
df6 = pd.DataFrame({
    'name':['joe', 'susan', 'anne', 'black', 'monika','ronaldo','leonarldo','tom','yilianna','bulanni'],
    'age':[19,19,18,20,20,18,19,20,18,19],
    'sex':['man','women','women','man','women','man','man','man','women','women'],
    'address':['上海','北京','上海','北京','北京','上海','北京','上海','北京','上海'],
    'money':[8000,8500,7000,9000,10000,7500,8800,9300,12000,11000]
})
df6

  address  age  money       name    sex
0      上海   19   8000        joe    man
1      北京   19   8500      susan  women
2      上海   18   7000       anne  women
3      北京   20   9000      black    man
4      北京   20  10000     monika  women
5      上海   18   7500    ronaldo    man
6      北京   19   8800  leonarldo    man
7      上海   20   9300        tom    man
8      北京   18  12000   yilianna  women
9      上海   19  11000    bulanni  women

In [149]:
df6.pivot_table(values=['money'],index=['age'],aggfunc=(np.mean,np.min,np.max))

     money
      amax  amin         mean
age
18   12000  7000  8833.333333
19   11000  8000  9075.000000
20   10000  9000  9433.333333

In [150]:
df6.pivot_table(values=['money'],index=['age','address'],aggfunc=(np.mean,np.min,np.max))

             money
              amax   amin   mean
age address
18  上海        7500   7000   7250
    北京       12000  12000  12000
19  上海       11000   8000   9500
    北京        8800   8500   8650
20  上海        9300   9300   9300
    北京       10000   9000   9500